calculo/programas-calculo.tex
% Created 2021-12-14 mar 19:15
% Intended LaTeX compiler: pdflatex
\documentclass{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[spanish]{babel}
\usepackage{pifont}
\usepackage{pagecolor,lipsum}
\author{Luis Eduardo Galindo Amaya}
\date{\today}
\title{Programas Cálculo}
\hypersetup{
 pdfauthor={Luis Eduardo Galindo Amaya},
 pdftitle={Programas Cálculo},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.3 (Org mode 9.1.9)}, 
 pdflang={Spanish}}
\begin{document}

\maketitle
\tableofcontents

\newpage 

\section{Conversión Entre Sistemas De Coordenadas}
\label{sec:org95213f3}
\subsection{Rectangulares a Cilíndxricas (o Polares)}
\label{sec:orga157a2d}
\begin{verbatim}
# Sustituye el valor de 'x', 'y' y 'z'.

x = 1
y = 0
z = 0


# Añadir 1*10^-100 para evitar la divicion entre 0
# 'and' regresa 1 = True y 0 = False
x = x + and(x=0)*float(10^(-100))

r = sqrt(x^2+y^2)
theta = arctan(y/x)

# determinar la cantidad de ángulo faltante
# 'and' regresa 1 = True y 0 = False
ajuste(x,y) = ( 
   and(x>0 ,y>0)  * 0    + # I
   and(x<=0,y>0)  * pi   + # II
   and(x<0 ,y<=0) * pi   + # III
   and(x>0 ,y<0)  * 2*pi   # IV
)

# sumamos los grados faltantes
theta = theta+ajuste(x,y)

"Rectangular (x,y,z):"
float((x,y,z))

"Cilindrica (r,theta,z):"
float((r,theta,z))
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}

\begin{verbatim}
x = -1
y = 0


r = sqrt(x^2+y^2)
theta = arccos(x/r)

"Rectangular"
float((x,y))

"Cilindrica"
float((r,theta))
\end{verbatim}

\newpage 

\subsection{Rectangulares a Esféricas}
\label{sec:orgfefda79}
\begin{verbatim}
# Sustituye el valor de 'x', 'y' y 'z'.

x = 4
y = -5
z = 2



# Añadir 1*10^-100 para evitar la divicion entre 0
# 'and' regresa 1 = True y 0 = False
x = x + and(x=0)*float(10^(-100))

rho = sqrt(x^2+y^2+z^2)
theta = arctan(y/x)
phi = arccos(z/rho)

# determinar la cantidad de ángulo faltante
# 'and' regresa 1 = True y 0 = False
ajuste(x,y) = ( 
   and(x>0 ,y>0)  * 0    + # I
   and(x<=0,y>0)  * pi   + # II
   and(x<0 ,y<=0) * pi   + # III
   and(x>0 ,y<0)  * 2*pi   # IV
)

# sumamos los grados faltantes
theta = theta+ajuste(x,y)

"Rectangular (x,y,z):"
float((x,y,z))

"Esféricas (rho,theta,phi):"
float((rho,theta,phi))
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}

\newpage 

\subsection{Cilíndricas a Rectangulares}
\label{sec:orgf5e9510}
\begin{verbatim}
# Sustituye el valor de 'r', 'theta' y 'z'.

r = 4
theta = 2
z = 4


x = r * cos(theta)
y = r * sin(theta)
z = z

"Cilíndrica (r,theta,z):"
float((r,theta,z))

"Rectangular (x,y,z):"
float((x,y,z))
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}

\newpage 

\subsection{Cilíndricas a Esféricas}
\label{sec:orgcb73558}
\begin{verbatim}
# Sustituye el valor de 'r', 'theta' y 'z'
# theta es el angulo de los ejes 'x' y 'y'

r = 1
theta = 1
z = 1


rho = sqrt(r^2+z^2) 
theta = theta
phi = arccos(z/rho)

"Cilindrica (r,theta,z):"
float((r,theta,z))

"Esferica (rho,theta,phi):"
float((rho,theta,phi))
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}

\newpage

\subsection{Esfericas a Rectangulares}
\label{sec:orgdccd99e}
\begin{verbatim}
# Sustituye el valor de 'rho', 'theta' y 'phi'
# theta es el angulo de los ejes 'x' y 'y'
# phi es el angulo del eje 'z'

rho = 1
theta = 1
phi = 1


x = rho * sin(phi) * cos(theta)
y = rho * sin(phi) * sin(theta)
z = rho * cos(phi)

"Esferica (rho,theta,phi):"
float((rho,theta,phi))

"Rectangular (x,y,z):"
float((x,y,z))
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}

\newpage 

\subsection{Esfericas a Cilidnricas}
\label{sec:org7266a40}
\begin{verbatim}
# Sustituye el valor de 'rho', 'theta' y 'phi'
# theta es el angulo de los ejes 'x' y 'y'
# phi es el angulo del eje 'z'

rho = 1
theta = 1
phi = 1


r = rho * sin(phi)
theta = theta
z = rho * cos(phi)

"Esferica (rho,theta,phi):"
float((rho,theta,phi))

"Cilindrica (r,theta,z):"
float((r,theta,z))
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}

\newpage

\section{Modulo del Vector}
\label{sec:orgcd3fcab}
\subsection{Modulo}
\label{sec:org904fb0c}
\begin{verbatim}
# Sustituye los valores por los de tu vector (x,y,z).

v = (1,3,5)


abs(v)
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}

\subsection{Modulo del Vector Fuera Del Origen}
\label{sec:org772d0c6}
\begin{verbatim}
# Sustituye 'v' por los valores por los de tu vector.
# Sustituye 'g' los valores por los de el origen.

v = (1,3,5) # Vector
g = (0,0,0) # Origen


abs(v-g)
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}

\subsection{Producto Punto}
\label{sec:org5d5a916}
\begin{verbatim}
# Reemplaza 'A' y 'B' con tus vectores

A = (1,2,3)
B = (1,2,3)


dot(A,B)
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}

\subsection{Producto Cruz}
\label{sec:org0840ccb}
\begin{verbatim}
# Reemplaza 'A' y 'B' con tus vectores

A = (1,2,3)
B = (1,2,3)


cross(A,B)
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}

\subsection{Producto Mixto}
\label{sec:orgdbec2c2}
\begin{verbatim}
# Reemplaza 'A', 'B' y 'C' con tus vectores
A = (3,-2,5)
B = (2,2,-1)
C = (-4,3,2)


dot(A,cross(B,C)))
float
\end{verbatim}

\section{Aplicaciones De Vectores}
\label{sec:orgfbe662d}
\subsection{Vector Unitario}
\label{sec:org185d493}
\begin{verbatim}
# Sustituye 'v' por los valores por los de tu vector.

v = (1,3,5) # Vector


vu = v/abs(v)

"Vector unitario:"
float(vu)
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}

\subsection{Angulo Entre Vectores}
\label{sec:orgb2a6f91}
\begin{verbatim}
# Reemplaza 'A' y 'B' con tus vectores

A = (1,2,3)
B = (1,2,3)

arccos(dot(A,B)/(abs(A)*abs(B)))
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}

\subsection{Angulos Directores}
\label{sec:org920c8ef}
\begin{verbatim}
# Reemplaza 'A' con tu vector

A = (1,2,2)

alpha = float(arccos(A[1]/abs(A)))
 beta = float(arccos(A[2]/abs(A)))
gamma = float(arccos(A[3]/abs(A)))

"Angulos Directores (rad):"
alpha
beta
gamma
\end{verbatim}

\noindent\rule{\textwidth}{0.5pt}
\subsection{Área De Un Paralelogramo}
\label{sec:orga67109e}
\begin{verbatim}
# Reemplaza 'A' y 'B' con tus vectores

A = (3,1,-1)
B = (2,3,4)


"Area Paralelogramo"
float( abs(cross(A,B)) )
\end{verbatim}

\subsection{Área Del Triangulo}
\label{sec:org7c0e8ef}
\begin{verbatim}
# Reemplaza 'A' y 'B' con tus vectores

A = (3,1,-1)
B = (2,3,4)


"Area Paralelogramo"
float( 1/2 * abs(cross(A,B)) )
\end{verbatim}

\subsection{Volumen De Un Paralelepípedo}
\label{sec:org49eec07}
\begin{verbatim}
# Reemplaza 'A', 'B' y 'C' con tus vectores

A = (3,-2,5)
B = (2,2,-1)
C = (-4,3,2)


"Volumen paralelepípedo"
float(dot(A,cross(B,C)))
\end{verbatim}

\subsection{Volumen De Un Tetraedro}
\label{sec:org53a3fa1}
\begin{verbatim}
# Reemplaza 'A', 'B' y 'C' con tus vectores

A = (3,-2,5)
B = (2,2,-1)
C = (-4,3,2)


"Volumen paralelepípedo"
float( 1/6 * dot(A,cross(B,C)))
\end{verbatim}
\end{document}
